99.我的案例/Day52_WebService/Day23_WS_Client/target/classes/com/syc/ws/ajax05/ajax.html

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<script type="text/javascript">
	/* 利用AJAX请求WebService,可能存在跨域请求问题. */
	/* 解决跨域请求的方案:1.跟服务器协商,让服务器运行跨域请求. */
	/* 2.利用JSONP来解决跨域请求. */
	function queryTel() {

		/* 1.创建xmlHttp对象 */
		var xmlhttp;
		if (window.XMLHttpRequest) {
			xmlhttp = new XMLHttpRequest();
		} else {
			xmlhttp = new ActiveXObject("Microsoft.XMLHTTP");
		}

		/* 2.建立连接 */
		xmlhttp.open("post","http://ws.webxml.com.cn/WebServices/MobileCodeWS.asmx","true")
		/* 设置请求的内容类型 */
		xmlhttp.setRequestHeader("Content-Type", "text/xml;charset=utf-8");

		/* 4.回调函数 */
		xmlhttp.onreadystatechange = function() {
			if (xmlhttp.readyState == 4 && xmlhttp.status == 200) {
				alert(xmlhttp.responseText);
			}
		};

		/* 拼接成xml字符串 */
		var str = "<?xml version=\"1.0\" encoding=\"utf-8\"?>"
				+ "<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">"
				+ "<soap:Body>"
				+ "<getMobileCodeInfo xmlns=\"http://WebXml.com.cn/\">"
				+ "<mobileCode>" + document.getElementById("tel").value
				+ "</mobileCode>" + "<userID></userID>"
				+ "</getMobileCodeInfo>" + "</soap:Body>" + "</soap:Envelope>";

		/* 3.向服务器发送请求 */
		xmlhttp.send(str);
	}
</script>

</head>

<body>
	输入电话号码:
	<input type="text" id="tel" />
	<input type="button" value="查询手机号" onclick="queryTel()" />
</body>
</html>
